Revit 2027 API
BuiltInFailures.SheetCollectionFailures Class
 Failures about SheetCollection.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SheetCollectionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SheetCollectionFailures
Public NotInheritable Class SheetCollectionFailures
public ref class SheetCollectionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SheetCollectionFailures = class end
The BuiltInFailures.SheetCollectionFailures type exposes the following members.
Properties
Name | Description
SheetCollectionDuplicateName |  Sheet Collection name is already in use. Provide a unique name.
Top
See Also
Reference
Autodesk.Revit.DB Namespace